could you please copy the error you get?
I'm not able to repro the bug with this code :

```
resource "harbor_registry" "dockerhub" {
  provider_name = "docker-hub"
  name          = "test_docker_harbor"
  endpoint_url  = "https://hub.docker.com"
}
```

```
Terraform will perform the following actions:

  # harbor_registry.dockerhub will be created
  + resource "harbor_registry" "dockerhub" {
      + endpoint_url  = "https://hub.docker.com"
      + id            = (known after apply)
      + insecure      = false
      + name          = "test_docker_harbor"
      + provider_name = "docker-hub"
      + registry_id   = (known after apply)
      + status        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

harbor_registry.dockerhub: Creating...
harbor_registry.dockerhub: Creation complete after 1s [id=/registries/3]
```